---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor
source: html/fbd00cef-daa5-f249-9fa3-b6fc33baf79f.htm
---
# RebarFreeFormAccessor Methods

Add existing shared parameter as a dependency for the calculation of the rebar curves.